-- 허브 지역 설정

INSERT INTO p_hubs (
    hub_id,
    name,
    address,
    latitude,
    longitude,
    created_at
)
VALUES
    ('0b3f173f-2cd1-4f7d-b5a1-443d7a91c8b2',
     '서울특별시 센터',
     '서울특별시 송파구 송파대로 55',
     37.4746178, 127.1260071, CURRENT_TIMESTAMP),

    ('3998c724-a11c-49d5-99a5-03ad4dce8cc0',
     '경기 북부 센터',
     '경기도 고양시 덕양구 권율대로 570',
     37.6395015, 126.8738675, CURRENT_TIMESTAMP),

    ('71dd4a49-0341-4a45-b545-4518f41bd4f8',
     '경기 남부 센터',
     '경기도 이천시 호법면 덕평로 257-21',
     37.1903115, 127.3760896, CURRENT_TIMESTAMP),

    ('4387766a-7c13-4b70-9801-9c64a471bf22',
     '부산광역시 센터',
     '부산 동구 중앙대로 206',
     35.1157100, 129.0428216, CURRENT_TIMESTAMP),

    ('fcd2f93f-1837-42bc-a39f-36ca10d624e1',
     '대구광역시 센터',
     '대구 북구 태평로 161',
     35.8758026, 128.5959092, CURRENT_TIMESTAMP),

    ('ea80db50-6890-424e-89da-57a19bc861cb',
     '인천광역시 센터',
     '인천 남동구 정각로 29',
     37.4558148, 126.7062842, CURRENT_TIMESTAMP),

    ('d28f5e8e-4d5b-4df6-b970-b6deb54c1ddc',
     '광주광역시 센터',
     '광주 서구 내방로 111',
     35.1597705, 126.8515218, CURRENT_TIMESTAMP),

    ('9a01d94f-537e-410d-9c0e-1f4e222a93f0',
     '대전광역시 센터',
     '대전 서구 둔산로 100',
     36.3501707, 127.3848389, CURRENT_TIMESTAMP),

    ('80ed2751-76be-40fe-8f96-8a4b24ee274a',
     '울산광역시 센터',
     '울산 남구 중앙로 201',
     35.5388808, 129.3115449, CURRENT_TIMESTAMP),

    ('6f431420-cdd1-4d4a-a3d3-e4063f4daaf1',
     '세종특별자치시 센터',
     '세종특별자치시 한누리대로 2130',
     36.4799427, 127.2890590, CURRENT_TIMESTAMP),

    ('215bf8c8-0b51-4925-83a7-809c1d84ec06',
     '강원특별자치도 센터',
     '강원특별자치도 춘천시 중앙로 1',
     37.8825310, 127.7291452, CURRENT_TIMESTAMP),

    ('ece4da43-1b53-4c74-ac98-857c65a0c4c2',
     '충청북도 센터',
     '충북 청주시 상당구 상당로 82',
     36.6353828, 127.4914807, CURRENT_TIMESTAMP),

    ('a5e9e017-0fad-4f24-bdcb-50fe0d70df9b',
     '충청남도 센터',
     '충남 홍성군 홍북읍 충남대로 21',
     36.6588409, 126.6736967, CURRENT_TIMESTAMP),

    ('12ffedb4-ab76-4be1-b69f-d06aa35dca31',
     '전북특별자치도 센터',
     '전북특별자치도 전주시 완산구 효자로 225',
     35.8200701, 127.1091229, CURRENT_TIMESTAMP),

    ('3563a2d1-e2f5-439a-8acc-204fc2b3d2ea',
     '전라남도 센터',
     '전남 무안군 삼향읍 오룡길 1',
     34.8152658, 126.4573699, CURRENT_TIMESTAMP),

    ('99465363-491b-494d-9b53-d159fd257220',
     '경상북도 센터',
     '경북 안동시 풍천면 도청대로 455',
     36.5753879, 128.5054506, CURRENT_TIMESTAMP),

    ('e846b5f8-4890-4234-82d5-5e5fb47d6ade',
     '경상남도 센터',
     '경남 창원시 의창구 중앙대로 300',
     35.2371010, 128.6912625, CURRENT_TIMESTAMP);